{"status": "ok", "totalResults": 776, "articles": [{"source": {"id": null, "name": "Biztoc.com"}, "author": "barrons.com", "title": "Home Buyer Relief Ahead? When Prices Are Set to Fall", "description": "But there’s a glimmer of hope for buyers willing to take the plunge going into the holidays: Goldman Sachs economists are predicting prices will fall 0.8% through December, due to “the recent large increase in mortgage rates.”#goldmansachs", "url": "https://biztoc.com/x/d354e61e3ad9171e", "urlToImage": "https://c.biztoc.com/p/d354e61e3ad9171e/s.webp", "publishedAt": "2023-10-25T16:42:33Z", "content": "But theres a glimmer of hope for buyers willing to take the plunge going into the holidays: Goldman Sachs economists are predicting prices will fall 0.8% through December, due to the recent large inc… [+77 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "businessinsider.com", "title": "Mortgages will remain sky-high in 2024, pushing existing home sales to a 3-decade low, Goldman Sachs says", "description": "BrianAJackson/Getty Images Mortgage rates will stay high through 2024, dipping to just under 7% at year-end, Goldman Sachs forecasts. This will keep homeowners off the market, and the housing turnover rate will fall to its lowest since the 1990s. Higher rates…", "url": "https://biztoc.com/x/fae5402b1c4e9d7e", "urlToImage": "https://c.biztoc.com/p/fae5402b1c4e9d7e/s.webp", "publishedAt": "2023-10-23T17:54:40Z", "content": "BrianAJackson/Getty ImagesMortgage rates will stay high through 2024, dipping to just under 7% at year-end, Goldman Sachs forecasts.This will keep homeowners off the market, and the housing turnover … [+267 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "markets.businessinsider.com", "title": "Treasury bonds are yielding the same as the highest dividends paid by S&P 500 companies, Goldman Sachs says", "description": "Reuters / Brendan McDermid The yield on the 10-year Treasury is now about same as the highest dividends paid by S&P 500 firms. Bond yields have surged as investors fret over higher-for-longer interest rates. Dividend funds have seen big outflows this year, Go…", "url": "https://biztoc.com/x/e5d1d76fab454d7f", "urlToImage": "https://c.biztoc.com/p/e5d1d76fab454d7f/s.webp", "publishedAt": "2023-10-27T17:42:07Z", "content": "Reuters / Brendan McDermidThe yield on the 10-year Treasury is now about same as the highest dividends paid by S&amp;P 500 firms.Bond yields have surged as investors fret over higher-for-longer inter… [+257 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "businessinsider.com", "title": "Billionaire investor Leon Cooperman warns of sticky inflation and looming recession", "description": "Leon Cooperman. Rick Wilking/Reuters Leon Cooperman warned of sticky inflation, higher interest rates, and a potential recession. The billionaire investor blamed senseless fiscal and monetary policy in an interview with Insider. Cooperman called on US authori…", "url": "https://biztoc.com/x/179876731460d0a0", "urlToImage": "https://c.biztoc.com/p/179876731460d0a0/s.webp", "publishedAt": "2023-10-23T17:54:29Z", "content": "Leon Cooperman.Rick Wilking/ReutersLeon Cooperman warned of sticky inflation, higher interest rates, and a potential recession.The billionaire investor blamed senseless fiscal and monetary policy in … [+318 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "reuters.com", "title": "Hedge funds trim exposure to megacap tech stocks, banks say", "description": "Traders work on the floor of the New York Stock Exchange (NYSE) in New York City, U.S., August 15, 2023. REUTERS/Brendan McDermid/File Photo Acquire Licensing Rights NEW YORK, Oct 23 (Reuters) - Global hedge funds reduced their exposure to mega cap tech stock…", "url": "https://biztoc.com/x/9a02bc4fd620a742", "urlToImage": "https://c.biztoc.com/p/9a02bc4fd620a742/s.webp", "publishedAt": "2023-10-23T19:46:05Z", "content": "Traders work on the floor of the New York Stock Exchange (NYSE) in New York City, U.S., August 15, 2023. REUTERS/Brendan McDermid/File Photo Acquire Licensing RightsNEW YORK, Oct 23 (Reuters) - Globa… [+302 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "thestreet.com", "title": "Boeing shares higher as Goldman Sachs adds planemaker to 'conviction buy' list", "description": "Boeing BA shares moved higher in pre-market trading after analysts at Goldman Sachs added the planemaker to its 'conviction buy' list, citing solid long-term aircraft demand amid the ongoing surge in global travel. Goldman Sachs analyst Noah Poponak reiterate…", "url": "https://biztoc.com/x/42a8e16c0ef077ff", "urlToImage": "https://c.biztoc.com/p/42a8e16c0ef077ff/s.webp", "publishedAt": "2023-11-01T11:20:19Z", "content": "Boeing BA shares moved higher in pre-market trading after analysts at Goldman Sachs added the planemaker to its 'conviction buy' list, citing solid long-term aircraft demand amid the ongoing surge in… [+299 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "cnbc.com", "title": "Hanesbrands is shopping Champion", "description": "Brand management firms WHP Global and Authentic Brands Group are both interested in buying Champion from its parent company Hanesbrands , which is considering offloading the sportswear line amid pressure from activist investors, CNBC has learned. Hanesbrands …", "url": "https://biztoc.com/x/dbc2c17b8b0dbfe1", "urlToImage": "https://c.biztoc.com/p/dbc2c17b8b0dbfe1/s.webp", "publishedAt": "2023-11-01T11:08:07Z", "content": "Brand management firms WHP Global and Authentic Brands Group are both interested in buying Champion from its parent company Hanesbrands , which is considering offloading the sportswear line amid pres… [+289 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "consciounessofworld.com", "title": "India GDP growth projection", "description": "India is now world fifth highest ranking economy country in 2023 India is the fifth-largest economy, with a GDP of over USD 3.7 trillion It is estimated that India will surpass Germany and Japan's GDP by 2030. India GDP growth in FY 23-24 is 6.3% with GDP per…", "url": "https://biztoc.com/x/92a7281687841233", "urlToImage": "https://c.biztoc.com/p/92a7281687841233/s.webp", "publishedAt": "2023-10-29T06:40:11Z", "content": "India is now world fifth highest ranking economy country in 2023 India is the fifth-largest economy, with a GDP of over USD 3.7 trillion It is estimated that India will surpass Germany and Japan's GD… [+285 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "washingtonpost.com", "title": "Key takeaways from our deep look at the creator economy", "description": "Nearly two decades after the founding of Facebook, social media influencers dominate the modern internet, consume our attention and shape our daily lives. But the multibillion-dollar business that’s grown from their work, known as the creator economy, has oft…", "url": "https://biztoc.com/x/ec268674ef208f82", "urlToImage": "https://c.biztoc.com/p/ec268674ef208f82/s.webp", "publishedAt": "2023-10-31T10:10:40Z", "content": "Nearly two decades after the founding of Facebook, social media influencers dominate the modern internet, consume our attention and shape our daily lives. But the multibillion-dollar business thats g… [+237 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "apnews.com", "title": "Surge in interest rates and a cloudier economic picture to keep Federal Reserve on sidelines", "description": "The Federal Reserve is poised to leave its key interest rate unchanged Wednesday at a time when the Fed faces an economy that has proved resilient but is nevertheless under pressure from surging interest rates, overseas turmoil and anxious investors. U.S. eco…", "url": "https://biztoc.com/x/d31c5ffcde430669", "urlToImage": "https://c.biztoc.com/p/d31c5ffcde430669/og.webp", "publishedAt": "2023-10-31T12:50:11Z", "content": "The Federal Reserve is poised to leave its key interest rate unchanged Wednesday at a time when the Fed faces an economy that has proved resilient but is nevertheless under pressure from surging inte… [+329 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "barrons.com", "title": "These Stocks Are Moving the Most Today", "description": "Johnson & Johnson, Bank of America, and Goldman Sachs are scheduled to report third-quarter earnings on Tuesday, Ericsson slumps after withdrawing margin guidance, and NetScout reduces its outlook for fiscal 2024.#johnsonjohnson #bankofamerica #goldmansachs #…", "url": "https://biztoc.com/x/5ecf0027dd6776f0", "urlToImage": "https://c.biztoc.com/p/5ecf0027dd6776f0/s.webp", "publishedAt": "2023-10-17T08:44:16Z", "content": "Johnson &amp; Johnson, Bank of America, and Goldman Sachs are scheduled to report third-quarter earnings on Tuesday, Ericsson slumps after withdrawing margin guidance, and NetScout reduces its outloo… [+109 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "apnews.com", "title": "Rising long-term interest rates are posing the latest threat to a US economic 'soft landing'", "description": "Surging interest rates are intensifying the challenges for the U.S. economy and threatening to derail the Federal Reserve’s drive to tame inflation without causing a deep recession. Since mid-summer, the yield on the 10-year Treasury note, a benchmark for man…", "url": "https://biztoc.com/x/3ac3ed39a540824a", "urlToImage": "https://c.biztoc.com/p/3ac3ed39a540824a/s.webp", "publishedAt": "2023-10-05T09:08:08Z", "content": "Surging interest rates are intensifying the challenges for the U.S. economy and threatening to derail the Federal Reserves drive to tame inflation without causing a deep recession. Since mid-summer, … [+313 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "barrons.com", "title": "Week’s Best: Goldman Goes On Offense Against Departing Advisors", "description": "Goldman Sachs is taking action against dozens of advisors who have been leaving the company following the announcement of the sale of the Personal Financial Management unit to Creative Planning. The firm is filing arbitration claims seeking to enforce its non…", "url": "https://biztoc.com/x/af6f8c9ee63c1707", "urlToImage": "https://c.biztoc.com/p/af6f8c9ee63c1707/s.webp", "publishedAt": "2023-10-13T20:56:34Z", "content": "Goldman Sachs is taking action against dozens of advisors who have been leaving the company following the announcement of the sale of the Personal Financial Management unit to Creative Planning. The … [+267 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "benzinga.com", "title": "Israeli Shekel Stabilizes On Central Bank's $30B Intervention: ETFs Linked To Nation Rebound After Monday's Sell-off", "description": "Amid the ongoing conflict between Israel and Hamas, Israeli financial assets are on a path to recovery after a turbulent sell-off on Monday. The Israeli shekel (ILS) has marginally weakened by 0.1% as of 11:10 AM ET on Tuesday, following a 2.7% loss during Mo…", "url": "https://biztoc.com/x/5085cbef56dfbe22", "urlToImage": "https://c.biztoc.com/p/5085cbef56dfbe22/s.webp", "publishedAt": "2023-10-10T16:18:29Z", "content": "Amid the ongoing conflict between Israel and Hamas, Israeli financial assets are on a path to recovery after a turbulent sell-off on Monday.The Israeli shekel (ILS) has marginally weakened by 0.1% as… [+295 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "techcrunch.com", "title": "India’s InsuranceDekho raises another $60 million", "description": "InsuranceDekho, the insurer that was incubated within the automobile marketplace group CarDekho, has raised $60 million in a new funding round as the startup looks to supercharge its growth. Mitsubishi UFJ Financial Group, insurer BNP Paribas Cardif, Beams Fi…", "url": "https://biztoc.com/x/0f09f7c51d79279a", "urlToImage": "https://c.biztoc.com/p/0f09f7c51d79279a/s.webp", "publishedAt": "2023-10-11T01:26:07Z", "content": "InsuranceDekho, the insurer that was incubated within the automobile marketplace group CarDekho, has raised $60 million in a new funding round as the startup looks to supercharge its growth.Mitsubish… [+312 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "cointelegraph.com", "title": "Bitcoin Lightning Network growth jumps 1,200% in 2 years", "description": "Bitcoin’s layer 2 Lightning Network has seen an estimated 1,212% growth in two years, with around 6.6 million routed transactions in August, a significant jump compared to August 2021’s 503,000 transitions, according to data from the Bitcoin (BTC)-only exchan…", "url": "https://biztoc.com/x/b16a7f7f80c71435", "urlToImage": "https://c.biztoc.com/p/b16a7f7f80c71435/s.webp", "publishedAt": "2023-10-11T00:40:05Z", "content": "Bitcoins layer 2 Lightning Network has seen an estimated 1,212% growth in two years, with around 6.6 million routed transactions in August, a significant jump compared to August 2021s 503,000 transit… [+293 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "economist.com", "title": "Why it is time to retire Dr Copper", "description": "D famously reluctant to hang up their stethoscopes. But a time comes in the career of every medic when their skills fade, and a gentle push is the best thing for them—and their patients. The same applies for the metaphorical physicians of the financial world,…", "url": "https://biztoc.com/x/321588e0d973607d", "urlToImage": "https://c.biztoc.com/p/321588e0d973607d/s.webp", "publishedAt": "2023-10-19T10:30:08Z", "content": "D famously reluctant to hang up their stethoscopes. But a time comes in the career of every medic when their skills fade, and a gentle push is the best thing for themand their patients. The same appl… [+260 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "thestreet.com", "title": "Stocks edge lower, retail sales on deck, Goldman Sachs, United Airlines, Johnson & Johnson earnings", "description": "Five things you need to know before the market opens on Monday October 17: 1. -- Stock Market Today: Stocks slip lower with earnings, Biden Israel visit in focus An uneasy calm in Israel's war with Hamas has investors in a cautious mood Tuesday ahead of key r…", "url": "https://biztoc.com/x/68d570fa96e1c372", "urlToImage": "https://c.biztoc.com/p/68d570fa96e1c372/s.webp", "publishedAt": "2023-10-17T10:40:19Z", "content": "Five things you need to know before the market opens on Monday October 17:1. -- Stock Market Today: Stocks slip lower with earnings, Biden Israel visit in focusAn uneasy calm in Israel's war with Ham… [+290 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "finance.yahoo.com", "title": "Goldman Sachs profit plunges on impact from fintech sale, real estate bets", "description": "The ticker symbol and logo for Goldman Sachs is displayed on a screen on the floor at the NYSE in New York (Reuters) - Goldman Sachs' profit fell in the third quarter, weighed down by a writedown on its GreenSky fintech business and its investments in real es…", "url": "https://biztoc.com/x/0985d45d390408d1", "urlToImage": "https://c.biztoc.com/p/0985d45d390408d1/s.webp", "publishedAt": "2023-10-17T11:38:38Z", "content": "The ticker symbol and logo for Goldman Sachs is displayed on a screen on the floor at the NYSE in New York(Reuters) - Goldman Sachs' profit fell in the third quarter, weighed down by a writedown on i… [+326 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "nytimes.com", "title": "For Goldman Sachs, No Bad News Is Good News After a Brutal Stretch", "description": "In what at this point counts as merry news for a thrashed Wall Street giant, Goldman Sachs on Tuesday reported a quarterly profit that came in just above expectations, suggesting that the bank may be on track to extricate itself from its consumer-lending woes…", "url": "https://biztoc.com/x/95ec7943af30b790", "urlToImage": "https://c.biztoc.com/p/95ec7943af30b790/s.webp", "publishedAt": "2023-10-17T12:40:07Z", "content": "In what at this point counts as merry news for a thrashed Wall Street giant, Goldman Sachs on Tuesday reported a quarterly profit that came in just above expectations, suggesting that the bank may be… [+271 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "investing.com", "title": "Wall Street gyrates, Treasury yields spike on robust data, solid earnings", "description": "U.S. stocks wavered and benchmark Treasury yields surged on Tuesday as robust economic data and strong third-quarter earnings appeared to make the case for the Federal Reserve to keep restrictive policies in place for longer than expected. All three major U.S…", "url": "https://biztoc.com/x/e89fead155d6ecd8", "urlToImage": "https://c.biztoc.com/p/e89fead155d6ecd8/s.webp", "publishedAt": "2023-10-17T19:30:05Z", "content": "U.S. stocks wavered and benchmark Treasury yields surged on Tuesday as robust economic data and strong third-quarter earnings appeared to make the case for the Federal Reserve to keep restrictive pol… [+286 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "marketwatch.com", "title": "Momentum traders set to buy the S&P 500 'in every scenario,' says Goldman Sachs", "description": "Stocks are pointing to more gains, as yields go tumbling. Reopening after a holiday, bonds are rallying in part due to haven seeking after Hamas’ deadly attacks on Israel. But also, two Fed officials talked down interest rate hikes on Monday — more speakers a…", "url": "https://biztoc.com/x/573373b1f3e96bc4", "urlToImage": "https://c.biztoc.com/p/573373b1f3e96bc4/og.webp", "publishedAt": "2023-10-10T12:28:09Z", "content": "Stocks are pointing to more gains, as yields go tumbling. Reopening after a holiday, bonds are rallying in part due to haven seeking after Hamas deadly attacks on Israel. But also, two Fed officials … [+279 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "businessinsider.com", "title": "It is 'nearly unavoidable' that AI will cause a financial crash within a decade, SEC head says", "description": "SEC chairman Gary Gensler called for regulation to address the risk of AI in the financial markets Drew Angerer/Getty Images Gary Gensler told the Financial Times that the next financial crash could be sparked by AI. The SEC chair called for regulation to add…", "url": "https://biztoc.com/x/3390f0ced0571ff3", "urlToImage": "https://c.biztoc.com/p/3390f0ced0571ff3/s.webp", "publishedAt": "2023-10-16T12:06:07Z", "content": "SEC chairman Gary Gensler called for regulation to address the risk of AI in the financial marketsDrew Angerer/Getty ImagesGary Gensler told the Financial Times that the next financial crash could be… [+296 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "investors.com", "title": "Futures: Market Rally Snaps Back With Big Gains", "description": "Dow Jones futures were little changed ahead of Tuesday's open, along with S&P 500 futures and Nasdaq 100 futures, in overnight trade, after the Dow Jones Industrial Average rallied more than 300 points Monday. Netflix (NFLX) and Tesla earnings headline this w…", "url": "https://biztoc.com/x/2b8aa322aeea393a", "urlToImage": "https://c.biztoc.com/p/2b8aa322aeea393a/og.webp", "publishedAt": "2023-10-17T05:32:07Z", "content": "Dow Jones futures were little changed ahead of Tuesday's open, along with S&amp;P 500 futures and Nasdaq 100 futures, in overnight trade, after the Dow Jones Industrial Average rallied more than 300 … [+291 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "finance.yahoo.com", "title": "Goldman's profit declines amid costly retreat from consumer banking", "description": "Third quarter profits at Goldman Sachs (GS) fell as the Wall Street giant continued its costly retreat from consumer banking and tried to recover from a prolonged slump in dealmaking. Its earnings were $2.06 billion, down 33% from $3.07 billion a year ago. Th…", "url": "https://biztoc.com/x/f346232072ebe42f", "urlToImage": "https://c.biztoc.com/p/f346232072ebe42f/og.webp", "publishedAt": "2023-10-17T18:42:11Z", "content": "Third quarter profits at Goldman Sachs (GS) fell as the Wall Street giant continued its costly retreat from consumer banking and tried to recover from a prolonged slump in dealmaking.Its earnings wer… [+298 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "thestreet.com", "title": "Rebel's Edge -Analyzing Market News- $NVDA, $GS, $NTCT and Penn State vs Ohio State", "description": "Join Jon and Pete Najarian on today's episode of Rebel's Edge as they discuss stocks including Nvidia taking a hit after news of new restrictions on AI chip exports to China, Wyndham Hotels dodging a buyout, NetScout Systems tanking hard, and Goldman Sachs. G…", "url": "https://biztoc.com/x/b7eae962290e852b", "urlToImage": "https://c.biztoc.com/p/b7eae962290e852b/s.webp", "publishedAt": "2023-10-17T18:26:42Z", "content": "Join Jon and Pete Najarian on today's episode of Rebel's Edge as they discuss stocks including Nvidia taking a hit after news of new restrictions on AI chip exports to China, Wyndham Hotels dodging a… [+309 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "finance.yahoo.com", "title": "US futures slip as earnings floodgates open: Stock market news today", "description": "Stocks slipped ahead of the bell on Tuesday, as investors weighed the first in a flood of earnings and eyed the prospects for a US breakthrough in the Israel-Hamas conflict. Dow Jones Industrial Average (^DJI) futures were down 0.2%, after finishing Monday wi…", "url": "https://biztoc.com/x/95b5612d429934f2", "urlToImage": "https://c.biztoc.com/p/95b5612d429934f2/s.webp", "publishedAt": "2023-10-17T11:42:08Z", "content": "Stocks slipped ahead of the bell on Tuesday, as investors weighed the first in a flood of earnings and eyed the prospects for a US breakthrough in the Israel-Hamas conflict.Dow Jones Industrial Avera… [+303 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "benzinga.com", "title": "Earnings Scheduled For October 17, 2023", "description": "Goldman Sachs Gr GS is projected to report quarterly earnings at $5.31 per share on revenue of $11.14 billion. • Lockheed Martin LMT is estimated to report quarterly earnings at $6.66 per share on revenue of $16.73 billion. • Bank of America BAC is expected t…", "url": "https://biztoc.com/x/bf5563ee200bac8b", "urlToImage": "https://c.biztoc.com/p/bf5563ee200bac8b/s.webp", "publishedAt": "2023-10-17T11:26:12Z", "content": "Goldman Sachs Gr GS is projected to report quarterly earnings at $5.31 per share on revenue of $11.14 billion.Lockheed Martin LMT is estimated to report quarterly earnings at $6.66 per share on reven… [+314 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "cnbc.com", "title": "Morgan Stanley is set to report third-quarter earnings", "description": "Morgan Stanley is set to report third-quarter earnings before the opening bell on Wednesday. • Earnings: $1.28 a share, according to LSEG, formerly known as Refinitiv Morgan Stanley has managed to avoid the turbulence afflicting some of its rivals. While Gold…", "url": "https://biztoc.com/x/48b7bd18bd1eb6d9", "urlToImage": "https://c.biztoc.com/p/48b7bd18bd1eb6d9/s.webp", "publishedAt": "2023-10-18T11:10:06Z", "content": "Morgan Stanley is set to report third-quarter earnings before the opening bell on Wednesday.Earnings: $1.28 a share, according to LSEG, formerly known as RefinitivMorgan Stanley has managed to avoid … [+284 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "boredbat.com", "title": "US stocks rise amid diplomatic efforts to ease the Israel-Hamas conflict", "description": "US stocks moved higher in Monday’s trading session amid US diplomacy efforts to contain the conflict between Israel and Hamas. Secretary of State Antony Blinken was in Israel again on Monday after traveling there last week. President Biden, who is also weighi…", "url": "https://biztoc.com/x/5b71d4271a946de4", "urlToImage": "https://c.biztoc.com/253/og.png", "publishedAt": "2023-10-17T08:02:13Z", "content": "US stocks moved higher in Mondays trading session amid US diplomacy efforts to contain the conflict between Israel and Hamas.Secretary of State Antony Blinken was in Israel again on Monday after trav… [+294 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "aol.com", "title": "It is 'nearly unavoidable' that AI will cause a financial crash within a decade, SEC head says", "description": "None Gary Gensler told the Financial Times that the next financial crash could be sparked by AI. • None The SEC chair called for regulation to address how AI models are being used by banks on Wall Street. • None Banking has embraced AI, with Morgan Stanley ro…", "url": "https://biztoc.com/x/87a07b7de9c5589f", "urlToImage": "https://c.biztoc.com/p/87a07b7de9c5589f/s.webp", "publishedAt": "2023-10-16T14:08:07Z", "content": "None Gary Gensler told the Financial Times that the next financial crash could be sparked by AI.None The SEC chair called for regulation to address how AI models are being used by banks on Wall Stree… [+279 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "mishtalk.com", "title": "Mortgage rates are at a 22-Year High and Headed Towards Eight Percent", "description": "As mortgage rates surge to 7.7 percent, Goldman Sachs revises is 6.5 percent forecast. Mortgage Rates Easily Launched to New Long Term Highs by Upbeat Data Mortgage News Daily reports Mortgage Rates Easily Launched to New Long Term Highs by Upbeat Data Mortga…", "url": "https://biztoc.com/x/38f726983d60c095", "urlToImage": "https://c.biztoc.com/253/og.png", "publishedAt": "2023-10-05T09:16:06Z", "content": "As mortgage rates surge to 7.7 percent, Goldman Sachs revises is 6.5 percent forecast.Mortgage Rates Easily Launched to New Long Term Highs by Upbeat DataMortgage News Daily reports Mortgage Rates Ea… [+321 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "thetradenews.com", "title": "Coinbase sell-side equities specialist joins FalconX", "description": "Equities expert Tommy Doyle has joined Institutional crypto trading platform, FalconX, in an EMEA sales role, following a one and a half year stint at Coinbase.The sell-side equities specialist joined Coinbase’s institutional team last July, focused on leadin…", "url": "https://biztoc.com/x/36ed1f2c94c38842", "urlToImage": "https://c.biztoc.com/p/36ed1f2c94c38842/s.webp", "publishedAt": "2023-10-13T08:00:10Z", "content": "Equities expert Tommy Doyle has joined Institutional crypto trading platform, FalconX, in an EMEA sales role, following a one and a half year stint at Coinbase.The sell-side equities specialist joine… [+299 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "finance.yahoo.com", "title": "Buy These 2 Beaten-Down Stocks, Goldman Sachs Says, Forecasting up to 130% Upside", "description": "The Federal Reserve might have completed its round of rate hikes, based on recent statements made by the agency’s officials. Those statements conveyed the message that there is presently no urgent necessity to push the Fed funds rate beyond its existing range…", "url": "https://biztoc.com/x/62ad528e2103ab39", "urlToImage": "https://c.biztoc.com/p/62ad528e2103ab39/s.webp", "publishedAt": "2023-10-12T20:48:07Z", "content": "The Federal Reserve might have completed its round of rate hikes, based on recent statements made by the agencys officials. Those statements conveyed the message that there is presently no urgent nec… [+293 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "cnbc.com", "title": "Goldman Sachs is set to report third-quarter earnings", "description": "David Solomon, chief executive officer of Goldman Sachs Group Inc., at the Goldman Sachs Financial Services Conference in New York, Dec. 6, 2022. Goldman Sachs is scheduled to report third-quarter earnings before the opening bell Tuesday. • Earnings: $5.31 a …", "url": "https://biztoc.com/x/cd3083d17375e811", "urlToImage": "https://c.biztoc.com/p/cd3083d17375e811/s.webp", "publishedAt": "2023-10-17T04:08:05Z", "content": "David Solomon, chief executive officer of Goldman Sachs Group Inc., at the Goldman Sachs Financial Services Conference in New York, Dec. 6, 2022.Goldman Sachs is scheduled to report third-quarter ear… [+308 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "finance.yahoo.com", "title": "Stocks rise amid Middle East tensions: Stock market news today", "description": "Stocks opened higher Monday morning, as investors tracked US efforts to contain the Israel-Hamas conflict and got ready for a busy week of corporate earnings. The Dow Jones Industrial Average (^DJI) increased 0.6% or roughly 200 points, while the S&P 500 (^GS…", "url": "https://biztoc.com/x/42dd40551aa8e8f4", "urlToImage": "https://c.biztoc.com/p/42dd40551aa8e8f4/s.webp", "publishedAt": "2023-10-16T14:06:05Z", "content": "Stocks opened higher Monday morning, as investors tracked US efforts to contain the Israel-Hamas conflict and got ready for a busy week of corporate earnings.The Dow Jones Industrial Average (^DJI) i… [+298 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "theguardian.com", "title": "Goldman Sachs CEO David Solomon ends DJ gigs due to media ‘distraction’", "description": "The music has stopped for the chief executive of Goldman Sachs, David Solomon, amid reports that the US investment bank’s board was concerned his DJing sideline would distract him from his main job. Solomon has formally hung up his headphones on high-profile …", "url": "https://biztoc.com/x/11d05baa974362b2", "urlToImage": "https://c.biztoc.com/p/11d05baa974362b2/og.webp", "publishedAt": "2023-10-17T18:27:04Z", "content": "The music has stopped for the chief executive of Goldman Sachs, David Solomon, amid reports that the US investment banks board was concerned his DJing sideline would distract him from his main job.So… [+300 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "forbes.com", "title": "Netflix Earnings: Subscribers Swell To Record 247 Million As Stock Soars", "description": "Netflix beat Wall Street expectations for profit and user growth during the third quarter, sending its stock surging as the streaming giant rolled out another price increase. Netflix brought in $8.54 billion of revenue during the three-month period ending Sep…", "url": "https://biztoc.com/x/555a61fecb2db082", "urlToImage": "https://c.biztoc.com/p/555a61fecb2db082/s.webp", "publishedAt": "2023-10-18T20:30:10Z", "content": "Netflix beat Wall Street expectations for profit and user growth during the third quarter, sending its stock surging as the streaming giant rolled out another price increase.Netflix brought in $8.54 … [+291 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "investing.com", "title": "A one-two punch for SunPower ahead of slashed solar incentives: 5 big analyst cuts By", "description": "Investing.com -- Here is your Pro Recap of the biggest analyst cuts you may have missed today: downgrades at SunPower, BJ's Wholesale Club, DXC Technology, WEC Energy Group, and Kosmos Energy. InvestingPro subscribers got this news first. Never miss another m…", "url": "https://biztoc.com/x/a9528fffde99d7e3", "urlToImage": "https://c.biztoc.com/p/a9528fffde99d7e3/s.webp", "publishedAt": "2023-10-17T18:34:06Z", "content": "Investing.com -- Here is your Pro Recap of the biggest analyst cuts you may have missed today: downgrades at SunPower, BJ's Wholesale Club, DXC Technology, WEC Energy Group, and Kosmos Energy.Investi… [+308 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "ft.com", "title": "Oil industry megadeals open fee gusher for Wall Street advisers", "description": "Morgan Stanley and Goldman Sachs the biggest winners as energy industry bucks M&A downturn #goldmansachs", "url": "https://biztoc.com/x/3bc68546bc84f7d8", "urlToImage": "https://c.biztoc.com/p/3bc68546bc84f7d8/s.webp", "publishedAt": "2023-10-31T09:20:06Z", "content": "Morgan Stanley and Goldman Sachs the biggest winners as energy industry bucks M&amp;A downturn\r\n#goldmansachs\r\nThis story appeared on ft.com, ."}, {"source": {"id": null, "name": "Robb Report"}, "author": "Tori Latham", "title": "So Long, D-Sol: The CEO of Goldman Sachs Is Retiring From DJing", "description": "David Solomon has performed since 2015 under the name DJ D-Sol.", "url": "https://robbreport.com/lifestyle/news/david-solomon-goldman-sachs-dj-retiring-1235372178/", "urlToImage": "https://robbreport.com/wp-content/uploads/2023/10/Goldman-DJ.jpg?w=681&h=383&crop=1", "publishedAt": "2023-10-20T11:00:00Z", "content": "The CEO of Goldman Sachs has long moonlighted as a DJ, but it seems like the finance exec’s time behind the booth has come to an end.\r\nDavid Solomon has officially retired from DJing—at least publicl… [+1876 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "barrons.com", "title": "What McCarthy's Ouster as House Speaker Means for Government Shutdown Odds", "description": "Kevin McCarthy’s removal as speaker of the House creates a 'leadership vacuum' that makes a government shutdown next month more likely, say analysts at Goldman Sachs.#kevinmccarthy #goldmansachs", "url": "https://biztoc.com/x/92688cab09e994e7", "urlToImage": "https://c.biztoc.com/p/92688cab09e994e7/og.webp", "publishedAt": "2023-10-04T17:26:21Z", "content": "Kevin McCarthys removal as speaker of the House creates a 'leadership vacuum' that makes a government shutdown next month more likely, say analysts at Goldman Sachs.\r\n#kevinmccarthy#goldmansachs\r\nThi… [+33 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "barrons.com", "title": "Stocks to Watch This Week", "description": "More than 50 S&P 500 companies are set to report this week including Tesla, Netflix, TSMC, and Goldman Sachs. #tesla #netflix #tsmc #goldmansachs", "url": "https://biztoc.com/x/6661c8b15cdc5aee", "urlToImage": "https://c.biztoc.com/p/6661c8b15cdc5aee/s.webp", "publishedAt": "2023-10-16T08:56:09Z", "content": "More than 50 S&amp;P 500 companies are set to report this week including Tesla, Netflix, TSMC, and Goldman Sachs.\r\n#tesla#netflix#tsmc#goldmansachs\r\nThis story appeared on barrons.com, ."}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "barrons.com", "title": "Goldman Sachs Stock Is Below Book Value. It’s a Great Time to Buy", "description": "With the stock price a touch below what Goldman Sachs would be worth in a theoretical liquidation, investors now are effectively paying nothing for the franchise.#goldmansachs", "url": "https://biztoc.com/x/ead9771d067b37b4", "urlToImage": "https://c.biztoc.com/p/ead9771d067b37b4/s.webp", "publishedAt": "2023-10-17T17:42:59Z", "content": "With the stock price a touch below what Goldman Sachs would be worth in a theoretical liquidation, investors now are effectively paying nothing for the franchise.\r\n#goldmansachs\r\nThis story appeared … [+16 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "barrons.com", "title": "Goldman Stock Is Below Book Value. It's Time to Buy", "description": "With the stock price a touch below what Goldman Sachs would be worth in a theoretical liquidation, investors now are effectively paying nothing for the franchise.#goldmansachs", "url": "https://biztoc.com/x/8f0f9d157581e44e", "urlToImage": "https://c.biztoc.com/p/8f0f9d157581e44e/s.webp", "publishedAt": "2023-10-17T23:34:04Z", "content": "With the stock price a touch below what Goldman Sachs would be worth in a theoretical liquidation, investors now are effectively paying nothing for the franchise.\r\n#goldmansachs\r\nThis story appeared … [+16 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "abnormalreturns.com", "title": "Adviser links: a diversity of goals", "description": "Podcasts Daniel Crosby talks with Saundra Davis on how to effectively meet clients where they are. (standarddeviationspod.com) Michael Kitces and Carl Richards discuss the potential downside of specialized practices. (kitces.com) M&A The RIA buying frenzy is …", "url": "https://biztoc.com/x/f289e00140c61805", "urlToImage": "https://c.biztoc.com/253/og.png", "publishedAt": "2023-10-23T15:04:08Z", "content": "PodcastsDaniel Crosby talks with Saundra Davis on how to effectively meet clients where they are. (standarddeviationspod.com)Michael Kitces and Carl Richards discuss the potential downside of special… [+309 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "wsj.com", "title": "Goldman Sachs Veteran to Become CEO of Asset-Management Firm", "description": "Goldman Sachs veteran Luke Sarsfield , one of several executives to leave the bank recently, is set to become chief executive of asset manager P10 . Dallas-based P10, which specializes in so-called alternative investments, plans to announce the move Monday, p…", "url": "https://biztoc.com/x/680d174bc5fd1b36", "urlToImage": "https://c.biztoc.com/p/680d174bc5fd1b36/s.webp", "publishedAt": "2023-10-22T21:04:05Z", "content": "Goldman Sachs veteran Luke Sarsfield , one of several executives to leave the bank recently, is set to become chief executive of asset manager P10 .Dallas-based P10, which specializes in so-called al… [+169 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "aol.com", "title": "Computer-led equity hedge funds beat human stock-pickers in October", "description": "Hedge funds that trade equities using computer programmes defeated human stock-pickers in October by a large difference in performance, according to a Goldman Sachs note. Systematic long/short hedge funds, as the computer-led strategy is known, posted 4.97% i…", "url": "https://biztoc.com/x/99d7b5bc24ec7732", "urlToImage": "https://c.biztoc.com/p/99d7b5bc24ec7732/s.webp", "publishedAt": "2023-11-01T20:02:08Z", "content": "Hedge funds that trade equities using computer programmes defeated human stock-pickers in October by a large difference in performance, according to a Goldman Sachs note.Systematic long/short hedge f… [+228 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "barrons.com", "title": "Title Fight: Goldman Sachs Is Landing Punches Versus Morgan Stanley. Here’s How", "description": "Goldman Sachs had taken a backseat to rival Morgan Stanley in recent years, but third-quarter results suggest that Goldman is poised to emerge from its competitor’s shadow.#goldmansachs #goldman", "url": "https://biztoc.com/x/8680930d5882258c", "urlToImage": "https://c.biztoc.com/p/8680930d5882258c/s.webp", "publishedAt": "2023-10-18T20:10:31Z", "content": "Goldman Sachs had taken a backseat to rival Morgan Stanley in recent years, but third-quarter results suggest that Goldman is poised to emerge from its competitors shadow.\r\n#goldmansachs#goldman\r\nThi… [+33 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "seattletimes.com", "title": "Goldman Sachs 3Q profits fall 33% as trading, investment banking remains stagnant", "description": "Goldman Sachs saw its third quarter earnings fall 33%, with the investment bank seeing muted market conditions that allowed fewer deals and market making opportunities for the firm.#goldmansachs", "url": "https://biztoc.com/x/432c6be9bddc7288", "urlToImage": "https://c.biztoc.com/p/432c6be9bddc7288/s.webp", "publishedAt": "2023-10-17T13:42:02Z", "content": "Goldman Sachs saw its third quarter earnings fall 33%, with the investment bank seeing muted market conditions that allowed fewer deals and market making opportunities for the firm.\r\n#goldmansachs\r\nT… [+40 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "cnbc.com", "title": "'Incredible alpha opportunities' in the year ahead despite headwinds, says Carlyle Group CEO Harvey Schwartz", "description": "Several of Wall Street's biggest names convened in Riyadh, Saudi Arabia, for the kingdom's annual Future Investment Initiative, during which they weighed in on risks and opportunities for investors and the global economy. Bankers speaking on panel discussions…", "url": "https://biztoc.com/x/1e3d7bdbaf97b87a", "urlToImage": "https://c.biztoc.com/p/1e3d7bdbaf97b87a/s.webp", "publishedAt": "2023-10-25T07:54:05Z", "content": "Several of Wall Street's biggest names convened in Riyadh, Saudi Arabia, for the kingdom's annual Future Investment Initiative, during which they weighed in on risks and opportunities for investors a… [+262 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "seattletimes.com", "title": "Malaysia questions Goldman Sachs lawsuit over 1MDB settlement, saying it’s premature", "description": "The Malaysian government has questioned a move by Goldman Sachs to file for arbitration in a dispute connected with the multibillion-dollar looting of a sovereign wealth fund.#malaysian #goldmansachs", "url": "https://biztoc.com/x/136a7f96a624a716", "urlToImage": "https://c.biztoc.com/p/136a7f96a624a716/s.webp", "publishedAt": "2023-10-12T09:33:19Z", "content": "The Malaysian government has questioned a move by Goldman Sachs to file for arbitration in a dispute connected with the multibillion-dollar looting of a sovereign wealth fund.\r\n#malaysian#goldmansach… [+44 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "barrons.com", "title": "D.R. Horton Stock Is Upgraded. Buyers Prefer Quick Move-In Homes, Says Analyst", "description": "focus on quick move-in homes provides upside to the stock, according to an analyst at Goldman Sachs, while rising mortgage rates and higher home prices are risks to .#goldmansachs", "url": "https://biztoc.com/x/28af3002927bc874", "urlToImage": "https://c.biztoc.com/p/28af3002927bc874/s.webp", "publishedAt": "2023-10-16T15:32:07Z", "content": "focus on quick move-in homes provides upside to the stock, according to an analyst at Goldman Sachs, while rising mortgage rates and higher home prices are risks to .\r\n#goldmansachs\r\nThis story appea… [+20 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "barrons.com", "title": "Best Buy Stock Has 21% Upside, Says Goldman Sachs", "description": "stock is down by a double-digit percentage this year, pummeled by lagging demand for consumer electronics. Goldman Sachs believes the retailer’s shares are poised for a turnaround.#goldmansachs", "url": "https://biztoc.com/x/c2cfbfd4e38dd13b", "urlToImage": "https://c.biztoc.com/p/c2cfbfd4e38dd13b/s.webp", "publishedAt": "2023-10-19T15:23:48Z", "content": "stock is down by a double-digit percentage this year, pummeled by lagging demand for consumer electronics. Goldman Sachs believes the retailers shares are poised for a turnaround.\r\n#goldmansachs\r\nThi… [+33 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "investing.com", "title": "SolarEdge hit with several downgrades following Q3 warning: 4 big analyst cuts By", "description": "Investing.com — Here is your Pro Recap of the biggest analyst cuts you may have missed today: downgrades at SolarEdge Technologies, Yum! Brands, , and Blue Owl Capital. InvestingPro subscribers got this news first. Never miss another market-moving headline. S…", "url": "https://biztoc.com/x/50ca4a5b04b29152", "urlToImage": "https://c.biztoc.com/p/50ca4a5b04b29152/s.webp", "publishedAt": "2023-10-20T17:48:07Z", "content": "Investing.com Here is your Pro Recap of the biggest analyst cuts you may have missed today: downgrades at SolarEdge Technologies, Yum! Brands, , and Blue Owl Capital.InvestingPro subscribers got this… [+296 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "wsj.com", "title": "Goldman Sachs Collects $4 Billion for Infrastructure Deals", "description": "Goldman Sachs Group’s asset management business has collected $4 billion to invest in midsize infrastructure assets, as investors look to take advantage of a favorable political and economic climate for the sector. Goldman Sachs Asset Management closed West S…", "url": "https://biztoc.com/x/eee03e7f9ca92590", "urlToImage": "https://c.biztoc.com/p/eee03e7f9ca92590/s.webp", "publishedAt": "2023-10-23T11:18:06Z", "content": "Goldman Sachs Groups asset management business has collected $4 billion to invest in midsize infrastructure assets, as investors look to take advantage of a favorable political and economic climate f… [+254 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "cnbc.com", "title": "'Incredible alpha opportunities' in the year ahead despite headwinds, says Carlyle Group CEO Harvey Schwartz", "description": "Several of Wall Street's biggest names convened in Riyadh, Saudi Arabia, for the kingdom's annual Future Investment Initiative, during which they weighed in on risks and opportunities for investors and the global economy. Bankers speaking on panel discussions…", "url": "https://biztoc.com/x/2ed2ebf11c909c42", "urlToImage": "https://c.biztoc.com/p/2ed2ebf11c909c42/og.webp", "publishedAt": "2023-10-25T08:40:07Z", "content": "Several of Wall Street's biggest names convened in Riyadh, Saudi Arabia, for the kingdom's annual Future Investment Initiative, during which they weighed in on risks and opportunities for investors a… [+262 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "pymnts.com", "title": "Deserve Adds Digital Processing Capabilities to Credit Card Issuing Platform", "description": "Deserve, a mobile-first credit card issuing platform, launched new digital processing capabilities that aim to help banks and credit unions transform digital payment experiences. The capabilities, built using Mastercard technologies, provide direct connectivi…", "url": "https://biztoc.com/x/35579c4908f8c14d", "urlToImage": "https://c.biztoc.com/p/35579c4908f8c14d/s.webp", "publishedAt": "2023-10-24T21:40:18Z", "content": "Deserve, a mobile-first credit card issuing platform, launched new digital processing capabilities that aim to help banks and credit unions transform digital payment experiences.The capabilities, bui… [+298 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "markets.businessinsider.com", "title": "Warren Buffett dumped a bunch of bank stocks before their epic tumble this year, escaping some major pain", "description": "Warren Buffett. Getty Images / Michael Buckner Warren Buffett dodged some of the painful downturn in banking stocks this year. Berkshire Hathaway has exited Wells Fargo, Goldman Sachs, and other lenders since early 2020. Buffett said he soured on some banks a…", "url": "https://biztoc.com/x/2cc998290319730a", "urlToImage": "https://c.biztoc.com/p/2cc998290319730a/s.webp", "publishedAt": "2023-10-26T12:56:09Z", "content": "Warren Buffett.Getty Images / Michael BucknerWarren Buffett dodged some of the painful downturn in banking stocks this year.Berkshire Hathaway has exited Wells Fargo, Goldman Sachs, and other lenders… [+258 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "reuters.com", "title": "Marketmind: Treasuries relief, China grief", "description": "Passersby are reflected on an electric stock quotation board outside a brokerage in Tokyo, Japan April 18, 2023. REUTERS/Issei Kato Acquire Licensing Rights Oct 24 (Reuters) - A look at the day ahead in Asian markets from Jamie McGeever, financial markets col…", "url": "https://biztoc.com/x/ac08e6464e9fe60a", "urlToImage": "https://c.biztoc.com/p/ac08e6464e9fe60a/s.webp", "publishedAt": "2023-10-23T22:06:06Z", "content": "Passersby are reflected on an electric stock quotation board outside a brokerage in Tokyo, Japan April 18, 2023. REUTERS/Issei Kato Acquire Licensing RightsOct 24 (Reuters) - A look at the day ahead … [+307 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "fastcompany.com", "title": "1% of venture capital goes to Black founders. California’s new bill hopes to shame VCs into change", "description": "In an attempt to increase transparency around diversity and make the industry more equitable, California passed a law requiring VC firms to disclose diversity data about the companies they fund. But while this might nudge some companies to make their funding …", "url": "https://biztoc.com/x/0a588080d6ef09ba", "urlToImage": "https://c.biztoc.com/p/0a588080d6ef09ba/s.webp", "publishedAt": "2023-10-20T09:26:06Z", "content": "In an attempt to increase transparency around diversity and make the industry more equitable, California passed a law requiring VC firms to disclose diversity data about the companies they fund. But … [+320 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "dailyhodl.com", "title": "Former Goldman Executive Says Retail Will Front Run VCs and Institutions Before Crypto Explosion", "description": "Macro guru Raoul Pal says that retail investors have a chance to get ahead of venture capitalists and blue-chip investors before the crypto markets skyrocket. In a new interview on the Overpriced JPEGs podcast, the former Goldman Sachs executive says that for…", "url": "https://biztoc.com/x/0880644d024d2acf", "urlToImage": "https://c.biztoc.com/p/0880644d024d2acf/s.webp", "publishedAt": "2023-10-23T11:52:24Z", "content": "Macro guru Raoul Pal says that retail investors have a chance to get ahead of venture capitalists and blue-chip investors before the crypto markets skyrocket.In a new interview on the Overpriced JPEG… [+274 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "thetradenews.com", "title": "Leaders in Trading 2023: Meet the nominees for… Outstanding Dark Trading Venue", "description": "Next up in our Leaders in Trading 2023 Editors’ Choice Awards write up series, we bring you the shortlisted candidates for Outstanding Dark Trading Venue, showcasing exceptional performance in the non-disclosed trading arena. Over the last year, these dark tr…", "url": "https://biztoc.com/x/b938d9a27e9a3dff", "urlToImage": "https://c.biztoc.com/p/b938d9a27e9a3dff/s.webp", "publishedAt": "2023-10-23T12:26:18Z", "content": "Next up in our Leaders in Trading 2023 Editors Choice Awards write up series, we bring you the shortlisted candidates for Outstanding Dark Trading Venue, showcasing exceptional performance in the non… [+287 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "news.bitcoin.com", "title": "Binance Latam Regional VP: ‘We Intend to Become Regulated in Argentina’", "description": "Min Lin, Latam regional vice president at Binance, referred to the intention of the institution to become regulated in Argentina after a specific law to license crypto brokers is approved. Lin stated the exchange is talking with regulators to introduce innova…", "url": "https://biztoc.com/x/e5eae0c33079dbc8", "urlToImage": "https://c.biztoc.com/p/e5eae0c33079dbc8/s.webp", "publishedAt": "2023-10-24T08:34:07Z", "content": "Min Lin, Latam regional vice president at Binance, referred to the intention of the institution to become regulated in Argentina after a specific law to license crypto brokers is approved. Lin stated… [+292 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "ritholtz.com", "title": "The Greatest Missed Opportunity of Our Lifetimes", "description": "The chart in this morning’s reads shows what it is going to cost to fund the interest payments on the federal debt. It’s gone vertical as rates have moved from effectively 0 to over 5%. When rates were zero all of corporate America refinanced lowering the cos…", "url": "https://biztoc.com/x/f3b5622edb0787af", "urlToImage": "https://c.biztoc.com/253/og.png", "publishedAt": "2023-10-23T13:40:18Z", "content": "The chart in this mornings reads shows what it is going to cost to fund the interest payments on the federal debt. Its gone vertical as rates have moved from effectively 0 to over 5%.When rates were … [+305 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "geekwire.com", "title": "‘The markets crushed us’: In tearful farewell to employees, Convoy execs reflect on shutdown", "description": "Convoy CEO Dan Lewis, eyes watery from an emotional speech, said goodbye. Mark Okerstrom, president of the digital trucking marketplace, stood up and parted his flannel to show the Convoy logo on his shirt underneath, in an apparent attempt at a final display…", "url": "https://biztoc.com/x/96bff20350677a17", "urlToImage": "https://c.biztoc.com/p/96bff20350677a17/og.webp", "publishedAt": "2023-10-20T21:46:18Z", "content": "Convoy CEO Dan Lewis, eyes watery from an emotional speech, said goodbye. Mark Okerstrom, president of the digital trucking marketplace, stood up and parted his flannel to show the Convoy logo on his… [+289 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "cnbc.com", "title": "Big banks are done reporting earnings. Here’s how our financial names performed against peers", "description": "Despite a murky macroeconomic environment and heightened fears around the health of the banking sector, the nation's largest financial institutions all reported earnings beats for the third quarter. Some businesses performed better than others. However, none …", "url": "https://biztoc.com/x/2054beaac1a4b912", "urlToImage": "https://c.biztoc.com/p/2054beaac1a4b912/s.webp", "publishedAt": "2023-10-22T14:34:04Z", "content": "Despite a murky macroeconomic environment and heightened fears around the health of the banking sector, the nation's largest financial institutions all reported earnings beats for the third quarter. … [+285 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "cnbc.com", "title": "How our banks Wells Fargo and Morgan Stanley performed against peers", "description": "Despite a murky macroeconomic environment and heightened fears around the health of the banking sector, the nation's largest financial institutions all reported earnings beats for the third quarter. Some businesses performed better than others. However, none …", "url": "https://biztoc.com/x/47000f87b72053c4", "urlToImage": "https://c.biztoc.com/p/47000f87b72053c4/og.webp", "publishedAt": "2023-10-22T17:04:09Z", "content": "Despite a murky macroeconomic environment and heightened fears around the health of the banking sector, the nation's largest financial institutions all reported earnings beats for the third quarter. … [+285 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "reuters.com", "title": "Morning Bid: Awaiting the bond-bashing abating", "description": "A man is reflected on an electric stock quotation board outside a brokerage in Tokyo, Japan April 18, 2023. REUTERS/Issei Kato Acquire Licensing Rights Oct 23 (Reuters) - A look at the day ahead in Asian markets from Jamie McGeever, financial markets columnis…", "url": "https://biztoc.com/x/f309384747bfa1df", "urlToImage": "https://c.biztoc.com/p/f309384747bfa1df/s.webp", "publishedAt": "2023-10-22T22:14:06Z", "content": "A man is reflected on an electric stock quotation board outside a brokerage in Tokyo, Japan April 18, 2023. REUTERS/Issei Kato Acquire Licensing RightsOct 23 (Reuters) - A look at the day ahead in As… [+294 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "reuters.com", "title": "Goldman Sachs veteran to become CEO of asset-management firm P10, Wall Street Journal reports", "description": "Goldman Sachs veteran Luke Sarsfield is set to become chief executive of asset manager P10 (PX.N), the Wall Street Journal reported on Sunday. P10, which is a multi-asset class private market solutions provider in the alternative asset management industry, pl…", "url": "https://biztoc.com/x/566c43621b094249", "urlToImage": "https://c.biztoc.com/p/566c43621b094249/s.webp", "publishedAt": "2023-10-23T00:08:07Z", "content": "Goldman Sachs veteran Luke Sarsfield is set to become chief executive of asset manager P10 (PX.N), the Wall Street Journal reported on Sunday.P10, which is a multi-asset class private market solution… [+277 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "reuters.com", "title": "Australia's Treasury Wine surges on hopes of China revival", "description": "Australia's Treasury Wine Estates (TWE.AX) said on Monday it is well placed to rebuild its business in China, sending its shares up more than 5%, should Beijing's tariffs on Australian wine be removed as signalled by the two countries on the weekend. The Aust…", "url": "https://biztoc.com/x/b9f8f84ccfcafdf0", "urlToImage": "https://c.biztoc.com/p/b9f8f84ccfcafdf0/s.webp", "publishedAt": "2023-10-23T02:14:07Z", "content": "Australia's Treasury Wine Estates (TWE.AX) said on Monday it is well placed to rebuild its business in China, sending its shares up more than 5%, should Beijing's tariffs on Australian wine be remove… [+309 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "aol.com", "title": "Goldman Sachs wants to train 1,000 employees in ‘mental health first aid’ by 2024 as Wall Street confronts mental health crisis", "description": "It’s not uncommon for employers to offer training in first aid through programs like the Red Cross, where workers are taught essential life-saving medical skills needed in emergencies. But what if companies also trained workers in mental health first aid? It'…", "url": "https://biztoc.com/x/862bacb57d260182", "urlToImage": "https://c.biztoc.com/p/862bacb57d260182/s.webp", "publishedAt": "2023-10-20T15:12:06Z", "content": "Its not uncommon for employers to offer training in first aid through programs like the Red Cross, where workers are taught essential life-saving medical skills needed in emergencies. But what if com… [+306 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "scmp.com", "title": "Exits from China’s stock market add to worst capital flight since 2016: Goldman", "description": "Investors continue to withdraw money from China’s onshore stock exchanges amid , adding to the biggest capital flight from the nation in seven years, according to Goldman Sachs. Foreign investors were net sellers of US$3.3 billion of A shares last week, bring…", "url": "https://biztoc.com/x/d733de8defdaf322", "urlToImage": "https://c.biztoc.com/p/d733de8defdaf322/s.webp", "publishedAt": "2023-10-23T05:10:11Z", "content": "Investors continue to withdraw money from Chinas onshore stock exchanges amid , adding to the biggest capital flight from the nation in seven years, according to Goldman Sachs. Foreign investors were… [+331 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "aol.com", "title": "Billionaire investor Leon Cooperman says the S&P 500 won't hit a new high for years", "description": "None Leon Cooperman told Insider in an interview he thinks stocks are overvalued. • None The billionaire investor doesn't expect the S&P 500 to hit a fresh high for a long time. • None A \"rolling correction\" is underway, and house prices are likely to drop, C…", "url": "https://biztoc.com/x/a8d573b888ca79d3", "urlToImage": "https://c.biztoc.com/p/a8d573b888ca79d3/s.webp", "publishedAt": "2023-10-20T15:26:09Z", "content": "None Leon Cooperman told Insider in an interview he thinks stocks are overvalued.None The billionaire investor doesn't expect the S&amp;P 500 to hit a fresh high for a long time.None A \"rolling corre… [+307 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "cnbc.com", "title": "The economy probably showed gangbuster growth in the third quarter. But will it last?", "description": "The U.S. economy likely turned in another strong performance heading into the final part of the year, though what's ahead could be significantly different. Gross domestic product, or the sum of all goods and services produced in the U.S. economy, is expected …", "url": "https://biztoc.com/x/5efdb16180e7084b", "urlToImage": "https://c.biztoc.com/p/5efdb16180e7084b/s.webp", "publishedAt": "2023-10-25T22:48:06Z", "content": "The U.S. economy likely turned in another strong performance heading into the final part of the year, though what's ahead could be significantly different. Gross domestic product, or the sum of all g… [+312 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "forbes.com", "title": "With 8% Mortgage Rates, Here’s What Home Buyers Need To Know About The Economy", "description": "One of the biggest surprises this year has been the seeming resilience of U.S. home prices to rising interest rates. As the chart below shows, the 30-year fixed mortgage rate reached 8% last week for the first time since 2000. This has occurred as the yield o…", "url": "https://biztoc.com/x/a819f593d090f94e", "urlToImage": "https://c.biztoc.com/p/a819f593d090f94e/s.webp", "publishedAt": "2023-10-25T16:12:07Z", "content": "One of the biggest surprises this year has been the seeming resilience of U.S. home prices to rising interest rates. As the chart below shows, the 30-year fixed mortgage rate reached 8% last week for… [+301 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "thestreet.com", "title": "Here are Morningstar's fab four stocks following earnings reports", "description": "We’re in the midst of the third-quarter earnings season, and it’s been a pretty good one so far. As of Friday, 17% of S&P 500 companies had reported their results. A hefty 73% of them posted profit above analyst expectations, and 66% of them registered revenu…", "url": "https://biztoc.com/x/a8a6c4bec10d80d2", "urlToImage": "https://c.biztoc.com/p/a8a6c4bec10d80d2/s.webp", "publishedAt": "2023-10-25T19:08:22Z", "content": "Were in the midst of the third-quarter earnings season, and its been a pretty good one so far.As of Friday, 17% of S&amp;P 500 companies had reported their results. A hefty 73% of them posted profit … [+287 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "techcrunch.com", "title": "Apple Pay Later is now available to all users in the US", "description": "Apple Pay Later is now available to all users in the US Apple is making Apple Pay Later available to all users in the United States, after initially releasing it to a limited number of users back in March. Apple Pay Later allows users to split the cost of an …", "url": "https://biztoc.com/x/d8a8c32a808fa6ee", "urlToImage": "https://c.biztoc.com/p/d8a8c32a808fa6ee/s.webp", "publishedAt": "2023-10-25T19:50:06Z", "content": "Apple Pay Later is now available to all users in the USApple is making Apple Pay Later available to all users in the United States, after initially releasing it to a limited number of users back in M… [+299 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "foxbusiness.com", "title": "Slowing economy presenting more challenges: NABE", "description": "The nation's leading economists stopped short of forecasting a full-blown recession, but they do see headwinds for the U.S. economy. \"The October 2023 Business Conditions Survey results suggest a more challenging business environment as the economy slows,\" sa…", "url": "https://biztoc.com/x/5e7f3655deb05a96", "urlToImage": "https://c.biztoc.com/p/5e7f3655deb05a96/s.webp", "publishedAt": "2023-10-30T05:06:06Z", "content": "The nation's leading economists stopped short of forecasting a full-blown recession, but they do see headwinds for the U.S. economy. \"The October 2023 Business Conditions Survey results suggest a mor… [+296 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "nytimes.com", "title": "Morgan Stanley’s Post-Gorman Era Begins", "description": "Wall Street’s most closely watched succession saga ended with the selection of Ted Pick as the bank’s next leader. But he now must keep the momentum going. One of Wall Street’s most closely watched succession races is over as Ted Pick prepares to become Morga…", "url": "https://biztoc.com/x/997331ec01707e33", "urlToImage": "https://c.biztoc.com/p/997331ec01707e33/s.webp", "publishedAt": "2023-10-26T12:16:06Z", "content": "Wall Streets most closely watched succession saga ended with the selection of Ted Pick as the banks next leader. But he now must keep the momentum going.One of Wall Streets most closely watched succe… [+299 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "coindesk.com", "title": "Ethereum’s Dencun Upgrade Is a Step Toward a Scalable Settlement Layer: Goldman Sachs", "description": "Ethereum’s Dencun upgrade, likely to take place in first-quarter 2024, is the next step in the blockchain’s journey to becoming a scalable settlement layer, Goldman Sachs (GS) said in a note Thursday. “Dencun’s primary impact will be to increase its data avai…", "url": "https://biztoc.com/x/2eb1f87da2c5bf8f", "urlToImage": "https://c.biztoc.com/p/2eb1f87da2c5bf8f/s.webp", "publishedAt": "2023-10-27T10:30:05Z", "content": "Ethereums Dencun upgrade, likely to take place in first-quarter 2024, is the next step in the blockchains journey to becoming a scalable settlement layer, Goldman Sachs (GS) said in a note Thursday.D… [+286 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "aol.com", "title": "Country Garden has defaulted on its debt. What’s next?", "description": "China’s giant property developer Country Garden has been declared in default on its debt after failing to make a bond repayment by a final deadline of October 18. A panel of global banks and investors said Thursday that a “failure to pay” event had occurred o…", "url": "https://biztoc.com/x/9eba5f31873dca88", "urlToImage": "https://c.biztoc.com/p/9eba5f31873dca88/s.webp", "publishedAt": "2023-10-27T11:56:15Z", "content": "Chinas giant property developer Country Garden has been declared in default on its debt after failing to make a bond repayment by a final deadline of October 18.A panel of global banks and investors … [+291 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "nytimes.com", "title": "How Automation Has Changed Work for Casino Employees in Detroit", "description": "Ambre Romero at the MGM Grand Casino in downtown Detroit.Credit...Nick Hagen for The New York Times For cocktail servers and hotel housekeepers, the arrival of robotic technologies has made their jobs harder, they say. It’s part of why they’re on strike. On a…", "url": "https://biztoc.com/x/e640396d8e7567c5", "urlToImage": "https://c.biztoc.com/p/e640396d8e7567c5/s.webp", "publishedAt": "2023-10-27T09:16:07Z", "content": "Ambre Romero at the MGM Grand Casino in downtown Detroit.Credit...Nick Hagen for The New York TimesFor cocktail servers and hotel housekeepers, the arrival of robotic technologies has made their jobs… [+302 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "coindesk.com", "title": "First Mover Americas: Bitcoin and Ether Options Activity Hits $20B", "description": "This article originally appeared in First Mover, CoinDesk’s daily newsletter putting the latest moves in crypto markets in context. Subscribe to get it in your inbox every day. The crypto options market is booming. The notional open interest, or the dollar va…", "url": "https://biztoc.com/x/67d20c5f83332c55", "urlToImage": "https://c.biztoc.com/p/67d20c5f83332c55/s.webp", "publishedAt": "2023-10-27T12:22:05Z", "content": "This article originally appeared in First Mover, CoinDesks daily newsletter putting the latest moves in crypto markets in context. Subscribe to get it in your inbox every day.The crypto options marke… [+296 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "aol.com", "title": "China's Xi makes first known visit to central bank -sources", "description": "Chinese President Xi Jinping made his first known visit to the nation's central bank since he became president a decade ago, two sources with knowledge of the matter said, as China's economy and financial markets grapple with headwinds. Xi, along with Vice Pr…", "url": "https://biztoc.com/x/c791c72545c89bc2", "urlToImage": "https://c.biztoc.com/p/c791c72545c89bc2/s.webp", "publishedAt": "2023-10-24T12:42:09Z", "content": "Chinese President Xi Jinping made his first known visit to the nation's central bank since he became president a decade ago, two sources with knowledge of the matter said, as China's economy and fina… [+272 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "ritholtz.com", "title": "The Greatest Missed Opportunity of Our Lifetimes", "description": "The chart in this morning’s reads shows what it is going to cost to fund the interest payments on the federal debt. It’s gone vertical as rates have moved from effectively 0 to over 5%. When rates were zero all of corporate America refinanced, lowering the co…", "url": "https://biztoc.com/x/432322c6220467af", "urlToImage": "https://c.biztoc.com/p/432322c6220467af/og.webp", "publishedAt": "2023-10-25T07:50:16Z", "content": "The chart in this mornings reads shows what it is going to cost to fund the interest payments on the federal debt. Its gone vertical as rates have moved from effectively 0 to over 5%.When rates were … [+282 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "pymnts.com", "title": "Goldman Sachs Appoints David Kamo as Global Head of Financial Sponsor M&A", "description": "Goldman Sachs is appointing David Kamo as its global head of financial sponsor mergers and acquisitions (M&A). Kamo’s new role will involve leading the bank’s efforts in working with clients such as private equity firms and alternative asset managers, Reuters…", "url": "https://biztoc.com/x/541a6ac5254dcf46", "urlToImage": "https://c.biztoc.com/p/541a6ac5254dcf46/s.webp", "publishedAt": "2023-10-24T23:32:16Z", "content": "Goldman Sachs is appointing David Kamo as its global head of financial sponsor mergers and acquisitions (M&amp;A).Kamos new role will involve leading the banks efforts in working with clients such as… [+293 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "politico.com", "title": "Machine", "description": "Andy Kim is trying to do something rare in New Jersey politics: win by casting himself as a soft-spoken outsider. In a state known for its brass-knuckle campaign tactics, its machine-dominated politics and no shortage of characters tainted by dubious ethics o…", "url": "https://biztoc.com/x/d0d5bb7dba62411f", "urlToImage": "https://c.biztoc.com/p/d0d5bb7dba62411f/s.webp", "publishedAt": "2023-10-29T11:24:07Z", "content": "Andy Kim is trying to do something rare in New Jersey politics: win by casting himself as a soft-spoken outsider. In a state known for its brass-knuckle campaign tactics, its machine-dominated politi… [+300 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "reuters.com", "title": "Nomura reassesses mainland China business plan as losses mount", "description": "The logo of Nomura Securities is seen at the company's Head Office in Tokyo, Japan, November 28, 2016. REUTERS/Toru Hanai/File Photo Acquire Licensing Rights TOKYO, Oct 26 (Reuters) - Nomura Holdings (8604.T) said on Thursday it is reassessing its mainland Ch…", "url": "https://biztoc.com/x/e4538dfea856808b", "urlToImage": "https://c.biztoc.com/p/e4538dfea856808b/s.webp", "publishedAt": "2023-10-28T16:46:14Z", "content": "The logo of Nomura Securities is seen at the company's Head Office in Tokyo, Japan, November 28, 2016. REUTERS/Toru Hanai/File Photo Acquire Licensing RightsTOKYO, Oct 26 (Reuters) - Nomura Holdings … [+298 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "aol.com", "title": "Here's 3 reasons why Wall Street giants say investors should pay attention to Treasurys as yields soar", "description": "None Bonds are looking more attractive than stocks for the first time in years. • None The 10-year Treasury yield topped 5% for the first time since 2007 this week. • None There are three reasons why it could be a good time to plow cash into ultra-safe Treasu…", "url": "https://biztoc.com/x/95e66de59b7e4e56", "urlToImage": "https://c.biztoc.com/p/95e66de59b7e4e56/s.webp", "publishedAt": "2023-10-28T13:40:08Z", "content": "None Bonds are looking more attractive than stocks for the first time in years.None The 10-year Treasury yield topped 5% for the first time since 2007 this week.None There are three reasons why it co… [+293 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "aol.com", "title": "Wall Street is obsessed with AI. From the ‘new electricity’ to the next gold rush, here’s how top analysts see the tech revolution playing out", "description": "When Wall Street catches a whiff of a new innovation that could drive earnings growth, it tends to get a little overexcited. Sell-side analysts at investment banks rush to put out bullish research reports on related companies; economists and strategists start…", "url": "https://biztoc.com/x/b225118a79d52116", "urlToImage": "https://c.biztoc.com/p/b225118a79d52116/s.webp", "publishedAt": "2023-10-28T11:18:07Z", "content": "When Wall Street catches a whiff of a new innovation that could drive earnings growth, it tends to get a little overexcited. Sell-side analysts at investment banks rush to put out bullish research re… [+313 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "markets.businessinsider.com", "title": "Here's 3 reasons why Wall Street giants say investors should pay attention to Treasurys as yields soar", "description": "Getty Images / Bryan R. Smith Bonds are looking more attractive than stocks for the first time in years. The 10-year Treasury yield topped 5% for the first time since 2007 this week. There are three reasons why it could be a good time to plow cash into ultra-…", "url": "https://biztoc.com/x/24a4a2916f3fe196", "urlToImage": "https://c.biztoc.com/p/24a4a2916f3fe196/s.webp", "publishedAt": "2023-10-28T12:44:11Z", "content": "Getty Images / Bryan R. SmithBonds are looking more attractive than stocks for the first time in years.The 10-year Treasury yield topped 5% for the first time since 2007 this week.There are three rea… [+256 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "reuters.com", "title": "Goldman Sachs no longer sees U.S. govt shutdown in 2023", "description": "The U.S. Capitol Building is seen in Washington, U.S., August 15, 2023. REUTERS/Kevin Wurm/File Photo Acquire Licensing Rights Oct 30 (Reuters) - Goldman Sachs removed its forecast for a U.S. government shutdown this year given new geopolitical risks and the …", "url": "https://biztoc.com/x/f49eb9e48f36b449", "urlToImage": "https://c.biztoc.com/p/f49eb9e48f36b449/s.webp", "publishedAt": "2023-10-30T09:30:06Z", "content": "The U.S. Capitol Building is seen in Washington, U.S., August 15, 2023. REUTERS/Kevin Wurm/File Photo Acquire Licensing RightsOct 30 (Reuters) - Goldman Sachs removed its forecast for a U.S. governme… [+289 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "foxbusiness.com", "title": "Goldman Sachs CEO: Doesn’t see 1970-80s interest rates", "description": "As the Federal Reserve prepares to make another decision on interest rates, market participants are in tune with the recent mandate telegraphed by policymakers to keep rates higher for longer. The 10-year Treasury yield is already hovering near 5%, a 16-year-…", "url": "https://biztoc.com/x/b4ae7d348feecb43", "urlToImage": "https://c.biztoc.com/p/b4ae7d348feecb43/s.webp", "publishedAt": "2023-10-29T17:54:05Z", "content": "As the Federal Reserve prepares to make another decision on interest rates, market participants are in tune with the recent mandate telegraphed by policymakers to keep rates higher for longer. The 10… [+333 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "reuters.com", "title": "Barclays signals major cost cuts as margin pressure mounts", "description": "Britain's Barclays (BARC.L) will embark on another restructuring round in the coming months to mitigate the effects of margin pressure from competition in the savings market and another lacklustre performance from its investment bank. Shares in Barclays fell …", "url": "https://biztoc.com/x/09e292a01c0c6912", "urlToImage": "https://c.biztoc.com/p/09e292a01c0c6912/s.webp", "publishedAt": "2023-10-24T20:08:11Z", "content": "Britain's Barclays (BARC.L) will embark on another restructuring round in the coming months to mitigate the effects of margin pressure from competition in the savings market and another lacklustre pe… [+299 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "theguardian.com", "title": "Barclay family’s £1bn ‘back door’ offer for Telegraph alarms rival bidders", "description": "Bidders for the Telegraph are concerned the Barclay family’s £1bn “back door” offer could have a “chilling effect” on the official auction, according to a source close to the process. On Monday, the Barclays confirmed that they would make a £1bn Middle Easter…", "url": "https://biztoc.com/x/d8a0d76658644572", "urlToImage": "https://c.biztoc.com/p/d8a0d76658644572/s.webp", "publishedAt": "2023-10-26T08:10:06Z", "content": "Bidders for the Telegraph are concerned the Barclay familys £1bn back door offer could have a chilling effect on the official auction, according to a source close to the process.On Monday, the Barcla… [+303 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "cnbc.com", "title": "Tuesday's top stocks to watch on Wall Street", "description": "Here are the biggest calls on Wall Street on Tuesday: Bank of America reiterates Apple as neutral Bank of America said China remains a risk for Apple . \"China has been a 20%+ contributor to Apple's revenues and while competitive risks are increasing, we also …", "url": "https://biztoc.com/x/4bf70a15ce9bb9ff", "urlToImage": "https://c.biztoc.com/p/4bf70a15ce9bb9ff/og.webp", "publishedAt": "2023-10-25T13:54:12Z", "content": "Here are the biggest calls on Wall Street on Tuesday: Bank of America reiterates Apple as neutral Bank of America said China remains a risk for Apple . \"China has been a 20%+ contributor to Apple's r… [+279 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "forbes.com", "title": "How Long Can House Prices Withstand Mortgages At 8%?", "description": "One of the biggest surprises this year has been the seeming resilience of US home prices to rising interest rates with the 30-year fixed-rate mortgage rate reaching 8% last week for the first time since 2000 (see chart). This has occurred as the yield on the …", "url": "https://biztoc.com/x/88d963625b482a03", "urlToImage": "https://c.biztoc.com/p/88d963625b482a03/s.webp", "publishedAt": "2023-10-25T12:04:11Z", "content": "One of the biggest surprises this year has been the seeming resilience of US home prices to rising interest rates with the 30-year fixed-rate mortgage rate reaching 8% last week for the first time si… [+285 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "talkingbiznews.com", "title": "The Telegraph, Spectator up for grabs", "description": "The following excerpt was sent out from The Financial Times: The long-awaited sales process for the Telegraph and The Spectator has formally started in what will be a closely watched contest for one of the UK’s top national newspaper groups. On Friday, the bo…", "url": "https://biztoc.com/x/88fbc5f5260cd8ed", "urlToImage": "https://c.biztoc.com/p/88fbc5f5260cd8ed/s.webp", "publishedAt": "2023-10-24T16:30:12Z", "content": "The following excerpt was sent out from The Financial Times:The long-awaited sales process for the Telegraph and The Spectator has formally started in what will be a closely watched contest for one o… [+311 chars]"}, {"source": {"id": null, "name": "Biztoc.com"}, "author": "marketwatch.com", "title": "With mortgage rates near 8%, Goldman Sachs expects home prices to fall, then rebound in 2024", "description": "Home prices will fall for the rest of the year due to high mortgage rates and a low supply of houses for sale, Goldman Sachs GS, says in a new note. “While the sharpest declines in housing activity and prices are now long behind us, the recent jump in mortgag…", "url": "https://biztoc.com/x/18d45b0f0301a05a", "urlToImage": "https://c.biztoc.com/p/18d45b0f0301a05a/s.webp", "publishedAt": "2023-10-24T16:14:06Z", "content": "Home prices will fall for the rest of the year due to high mortgage rates and a low supply of houses for sale, Goldman Sachs GS, says in a new note.While the sharpest declines in housing activity and… [+297 chars]"}]}